Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum
The operation types.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum.UpdatePartLastData
UpdatePartLastData operation.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum.SetDifferenceAccepted
SetDifferenceAccepted operation.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum.IsDifferenceAccepted
IsDifferenceAccepted operation.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum.SynchToAnalysis
SynchToAnalysis operation.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum.ResetAnalysisPart
ResetAnalysisPart operation.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum.ResetAnalysisMod
ResetAnalysisMod operation.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum.SynchToPhysical
SynchToPhysical operation.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum.AddPartsToPhysical
AddPartsToPhysical operation.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum.GetChangeManagementEnabled
Get change management enabled/disabled.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum.SetChangeManagementEnabled
Set change management enabled/disabled.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum.StartLinkAnalysisPartToPhysical
Start link analysis part to physical.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum.LinkAnalysisPartToPhysical
Link analysis part to physical.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum.EndLinkAnalysisPartToPhysical
End link analysis part to physical.